Задание по лекции Topics in Macroeconomics: Underlying Datasets (Corporate Reporting)
=====================================================================================
29.10.2016

1. Сгенерировать или скачать набор данных на выбор из 
   [списка](https://github.com/epogrebnyak/data-rosstat-boo-2013/#Наборы-данных).

2. Выполнить [задание 3.1](https://github.com/epogrebnyak/data-rosstat-boo-2013#31)

3. Попробуйте сделать что-то из заданий 1,2,4 или 5.

4. Какие еще расчеты Вы бы предложили сделать на основе этого набора данных?

Предполагаемая форма контроля:
- консультация по результатам текущего задания (ориентировочно 5.11.2016)